app/controllers/aplicacions_controller.rb

SELECT "aplicacions".* FROM "aplicacions"
---
  def index
    @aplicacions = Aplicacion.all

INSERT INTO "aplicacions" ("nombre", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @aplicacion = Aplicacion.new(aplicacion_params)

    respond_to do |format|
      if @aplicacion.save

DELETE FROM "aplicacions" WHERE "aplicacions"."id" = $1  [["id", 1]]
---
  def destroy
    @aplicacion.destroy

SELECT  "aplicacions".* FROM "aplicacions" WHERE "aplicacions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_aplicacion
      @aplicacion = Aplicacion.find(params[:id])